In [265]:
import pandas as pd
import numpy as np

### Dataset

In [207]:
df = pd.read_csv("D:/datasets/dirty_cafe_sales.csv")

### Analysing the Dataset

In [208]:
df

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date
0,TXN_1961373,Coffee,2,2.0,4.0,Credit Card,Takeaway,2023-09-08
1,TXN_4977031,Cake,4,3.0,12.0,Cash,In-store,2023-05-16
2,TXN_4271903,Cookie,4,1.0,ERROR,Credit Card,In-store,2023-07-19
3,TXN_7034554,Salad,2,5.0,10.0,UNKNOWN,UNKNOWN,2023-04-27
4,TXN_3160411,Coffee,2,2.0,4.0,Digital Wallet,In-store,2023-06-11
...,...,...,...,...,...,...,...,...
9995,TXN_7672686,Coffee,2,2.0,4.0,NaN,UNKNOWN,2023-08-30
9996,TXN_9659401,NaN,3,NaN,3.0,Digital Wallet,NaN,2023-06-02
9997,TXN_5255387,Coffee,4,2.0,8.0,Digital Wallet,NaN,2023-03-02
9998,TXN_7695629,Cookie,3,NaN,3.0,Digital Wallet,NaN,2023-12-02
9999,TXN_6170729,Sandwich,3,4.0,12.0,Cash,In-store,2023-11-07

In [209]:
df.shape

(10000, 8)

In [210]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    10000 non-null  object
 1   Item              9667 non-null   object
 2   Quantity          9862 non-null   object
 3   Price Per Unit    9821 non-null   object
 4   Total Spent       9827 non-null   object
 5   Payment Method    7421 non-null   object
 6   Location          6735 non-null   object
 7   Transaction Date  9841 non-null   object
dtypes: object(8)
memory usage: 625.1+ KB

In [211]:
df.isna().sum()

Transaction ID         0
Item                 333
Quantity             138
Price Per Unit       179
Total Spent          173
Payment Method      2579
Location            3265
Transaction Date     159
dtype: int64

In [212]:
df.describe()

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date
count,10000,9667,9862,9821,9827,7421,6735,9841
unique,10000,10,7,8,19,5,4,367
top,TXN_9226047,Juice,5,3.0,6.0,Digital Wallet,Takeaway,UNKNOWN
freq,1,1171,2013,2429,979,2291,3022,159

In [213]:
df.columns

Index(['Transaction ID', 'Item', 'Quantity', 'Price Per Unit', 'Total Spent',
       'Payment Method', 'Location', 'Transaction Date'],
      dtype='object')

In [214]:
# Coping the dataframe
cafe = df.copy()

### Handling Null Values

In [215]:
df.isna().sum()

Transaction ID         0
Item                 333
Quantity             138
Price Per Unit       179
Total Spent          173
Payment Method      2579
Location            3265
Transaction Date     159
dtype: int64

In [216]:
df['Item'].unique()

array(['Coffee', 'Cake', 'Cookie', 'Salad', 'Smoothie', 'UNKNOWN',
       'Sandwich', nan, 'ERROR', 'Juice', 'Tea'], dtype=object)

In [217]:
df['Item'].fillna('UNKNOWN',inplace= True)

C:\Users\kkuri\AppData\Local\Temp\ipykernel_17488\502226893.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Item'].fillna('UNKNOWN',inplace= True)

In [218]:
df['Item'].isna().sum()

np.int64(0)

In [219]:
df['Quantity'].unique()

array(['2', '4', '5', '3', '1', 'ERROR', 'UNKNOWN', nan], dtype=object)

In [220]:
df['Price Per Unit'].unique()

array(['2.0', '3.0', '1.0', '5.0', '4.0', '1.5', nan, 'ERROR', 'UNKNOWN'],
      dtype=object)

In [221]:
unit_price = df[(df['Price Per Unit'] != 'UNKNOWN') & (df['Price Per Unit'] != 'ERROR')]['Price Per Unit']
total_amount = df[(df['Total Spent'] != 'UNKNOWN') & (df['Total Spent'] != 'ERROR')]['Total Spent']

In [222]:
princing = {
    'Coffee':'2.0', 
    'Cake' : '3.0', 
    'Cookie' : '1.0', 
    'Salad' : '5.0', 
    'Smoothie' : '4.0',
    'Sandwich' : '4.0', 
    'Juice': '3.0', 
    'Tea' : '1.5'
}

In [223]:
df['Price Per Unit']=df['Item'].map(princing)

In [224]:
df['Price Per Unit'].isna().sum()

np.int64(969)

In [225]:
df['Quantity'].fillna(total_amount.astype(float)//unit_price.astype(float),inplace=True)

C:\Users\kkuri\AppData\Local\Temp\ipykernel_17488\102784926.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Quantity'].fillna(total_amount.astype(float)//unit_price.astype(float),inplace=True)

In [226]:
df['Quantity'].isna().sum()

np.int64(13)

In [227]:
df[df['Quantity'].isna()]

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date
912,TXN_1575608,Sandwich,NaN,4.0,20.0,ERROR,Takeaway,2023-01-05
3203,TXN_4565754,Smoothie,NaN,4.0,ERROR,Digital Wallet,Takeaway,2023-10-06
3224,TXN_6297232,Coffee,NaN,2.0,UNKNOWN,NaN,NaN,2023-04-07
3401,TXN_3251829,Tea,NaN,1.5,NaN,Digital Wallet,In-store,2023-07-25
5639,TXN_6206792,Tea,NaN,1.5,6.0,Credit Card,NaN,2023-10-13
5845,TXN_8388462,Smoothie,NaN,4.0,8.0,UNKNOWN,Takeaway,2023-08-19
7029,TXN_4628338,Coffee,NaN,2.0,ERROR,Cash,NaN,2023-12-25
8443,TXN_2023651,Sandwich,NaN,4.0,ERROR,Cash,In-store,2023-05-25
8479,TXN_1547245,Sandwich,NaN,4.0,NaN,NaN,Takeaway,2023-09-11
8732,TXN_4550558,Cookie,NaN,1.0,NaN,Credit Card,In-store,2023-08-04
8975,TXN_8077367,Tea,NaN,1.5,7.5,Credit Card,NaN,2023-02-27
9464,TXN_5744797,Cake,NaN,3.0,3.0,Cash,In-store,2023-12-20
9869,TXN_1975184,Coffee,NaN,2.0,UNKNOWN,Digital Wallet,NaN,2023-01-15

In [228]:
df.isna().sum()

Transaction ID         0
Item                   0
Quantity              13
Price Per Unit       969
Total Spent          173
Payment Method      2579
Location            3265
Transaction Date     159
dtype: int64

In [229]:
new_df = df[df['Price Per Unit'].isna()] [['Quantity','Total Spent']]

In [230]:
value_qun = new_df[(new_df['Quantity'] != 'UNKNOWN') & (new_df['Quantity']!='ERROR')]['Quantity']

In [231]:
value_total = new_df[(new_df['Total Spent'] != 'UNKNOWN') & (new_df['Total Spent']!='ERROR')]['Total Spent'].dropna()

In [232]:
new_df['Total Spent'].unique()

array(['9.0', '15.0', '3.0', '10.0', 'ERROR', '5.0', '12.0', '25.0',
       '1.0', '16.0', '20.0', '8.0', '4.0', '7.5', '6.0', '2.0', nan,
       'UNKNOWN', '1.5', '4.5'], dtype=object)

In [233]:
value_qun.unique()

array(['3', '5', '2', '4', '1', 2.0, 1.0, 4.0, 3.0, 5.0], dtype=object)

In [234]:
value_total.unique()

array(['9.0', '15.0', '3.0', '10.0', '5.0', '12.0', '25.0', '1.0', '16.0',
       '20.0', '8.0', '4.0', '7.5', '6.0', '2.0', '1.5', '4.5'],
      dtype=object)

In [235]:
df['Price Per Unit'].fillna(value_total.astype(float)//value_qun.astype(float),inplace=True)

C:\Users\kkuri\AppData\Local\Temp\ipykernel_17488\1386634428.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Price Per Unit'].fillna(value_total.astype(float)//value_qun.astype(float),inplace=True)

In [236]:
df[df['Price Per Unit'].isna()]

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date
31,TXN_8927252,UNKNOWN,2,NaN,ERROR,Credit Card,ERROR,2023-11-06
153,TXN_6541415,UNKNOWN,UNKNOWN,NaN,12.0,Cash,In-store,2023-11-25
434,TXN_4796350,ERROR,ERROR,NaN,12.0,NaN,Takeaway,UNKNOWN
699,TXN_6434414,UNKNOWN,1,NaN,NaN,Digital Wallet,Takeaway,2023-03-10
724,TXN_5213542,UNKNOWN,ERROR,NaN,6.0,Credit Card,In-store,2023-08-21
...,...,...,...,...,...,...,...,...
9238,TXN_5985513,ERROR,ERROR,NaN,8.0,Credit Card,NaN,2023-08-02
9278,TXN_1166001,UNKNOWN,UNKNOWN,NaN,15.0,Cash,ERROR,NaN
9334,TXN_1565027,UNKNOWN,3,NaN,NaN,NaN,NaN,2023-03-16
9501,TXN_9163155,UNKNOWN,4,NaN,UNKNOWN,Credit Card,Takeaway,2023-04-23
9819,TXN_1208561,UNKNOWN,ERROR,NaN,20.0,Credit Card,NaN,2023-08-19

In [237]:
df.isna().sum()

Transaction ID         0
Item                   0
Quantity              13
Price Per Unit        92
Total Spent          173
Payment Method      2579
Location            3265
Transaction Date     159
dtype: int64

In [238]:
df[df['Total Spent'].isna()]

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date
25,TXN_7958992,Smoothie,3,4.0,NaN,UNKNOWN,UNKNOWN,2023-12-13
65,TXN_4987129,Sandwich,3,4.0,NaN,NaN,In-store,2023-10-20
146,TXN_7623634,Cake,2,3.0,NaN,Credit Card,In-store,2023-07-11
171,TXN_8989148,Tea,2,1.5,NaN,NaN,NaN,2023-11-25
238,TXN_5526852,Sandwich,5,4.0,NaN,Digital Wallet,In-store,2023-09-28
...,...,...,...,...,...,...,...,...
9827,TXN_3392953,Coffee,1,2.0,NaN,Digital Wallet,Takeaway,2023-01-06
9838,TXN_6744733,Sandwich,1,4.0,NaN,Cash,Takeaway,UNKNOWN
9890,TXN_2749289,Smoothie,2,4.0,NaN,Digital Wallet,Takeaway,2023-05-05
9988,TXN_9594133,Cake,5,3.0,NaN,ERROR,NaN,NaN
9993,TXN_4766549,Smoothie,2,4.0,NaN,Cash,NaN,2023-10-20

In [239]:
tol_df = df[(df['Quantity'].notnull()) & (df['Price Per Unit'].notnull())]

In [240]:
t_qun = tol_df[(tol_df['Quantity'] != 'ERROR')& (tol_df['Quantity'] != 'UNKNOWN')]['Quantity']
t_pric = tol_df[(tol_df['Price Per Unit'] != 'ERROR')& (tol_df['Price Per Unit'] != 'UNKNOWN')]['Price Per Unit']

In [241]:
t_qun.unique()

array(['2', '4', '5', '3', '1', 2.0, 3.0, 1.0, 5.0, 4.0], dtype=object)

In [242]:
t_pric.unique()

array(['2.0', '3.0', '1.0', '5.0', '4.0', 3.0, 1.0, 2.0, '1.5', 5.0, 4.0],
      dtype=object)

In [243]:
df['Total Spent'].fillna(t_qun.astype(float) * t_pric.astype(float),inplace=True)

C:\Users\kkuri\AppData\Local\Temp\ipykernel_17488\882152178.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Total Spent'].fillna(t_qun.astype(float) * t_pric.astype(float),inplace=True)

In [244]:
df['Total Spent'].isna().sum()

np.int64(24)

In [245]:
df.isna().sum()

Transaction ID         0
Item                   0
Quantity              13
Price Per Unit        92
Total Spent           24
Payment Method      2579
Location            3265
Transaction Date     159
dtype: int64

#### Droping the rows where we have more than 50 % data unavailable

In [270]:
def counting_null(row):
    count = 0
    for i in row:
        if (i == 'UNKNOWN') or (i=='ERROR'):
            count += 1
        elif pd.isna(i):
            count += 1
    return count

In [271]:
df['missing values count'] = df.apply(counting_null,axis=1)

In [272]:
df[df['missing values count'] >=4]

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date,missing values count
31,TXN_8927252,UNKNOWN,2,NaN,ERROR,Credit Card,ERROR,2023-11-06,4
434,TXN_4796350,ERROR,ERROR,NaN,12.0,NaN,Takeaway,UNKNOWN,5
641,TXN_2962976,Juice,UNKNOWN,3.0,ERROR,NaN,NaN,2023-03-17,4
727,TXN_8297135,UNKNOWN,2,NaN,UNKNOWN,ERROR,NaN,2023-09-16,5
796,TXN_8354174,ERROR,3,NaN,NaN,Credit Card,ERROR,2023-12-29,4
...,...,...,...,...,...,...,...,...,...
9238,TXN_5985513,ERROR,ERROR,NaN,8.0,Credit Card,NaN,2023-08-02,4
9278,TXN_1166001,UNKNOWN,UNKNOWN,NaN,15.0,Cash,ERROR,NaN,5
9334,TXN_1565027,UNKNOWN,3,NaN,NaN,NaN,NaN,2023-03-16,5
9610,TXN_4569448,UNKNOWN,1,3.0,3.0,NaN,NaN,UNKNOWN,4
9819,TXN_1208561,UNKNOWN,ERROR,NaN,20.0,Credit Card,NaN,2023-08-19,4

In [274]:
# Droping Unwanted Rows
condition = df['missing values count'] >= 4

In [275]:
df = df[~condition]

In [276]:
df[df['missing values count'] >=4]

Empty DataFrame
Columns: [Transaction ID, Item, Quantity, Price Per Unit, Total Spent, Payment Method, Location, Transaction Date, missing values count]
Index: []

In [277]:
df.isna().sum()

Transaction ID             0
Item                       0
Quantity                  12
Price Per Unit            38
Total Spent               10
Payment Method          2544
Location                3224
Transaction Date         153
missing values count       0
dtype: int64

In [279]:
df['Payment Method'].mode()

0    Digital Wallet
Name: Payment Method, dtype: object

In [280]:
payment_mode = 'Digital Wallet'

In [282]:
df['Payment Method'].fillna(payment_mode, inplace=True)

C:\Users\kkuri\AppData\Local\Temp\ipykernel_17488\4264357688.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Payment Method'].fillna(payment_mode, inplace=True)

In [283]:
df['Payment Method'].unique()

array(['Credit Card', 'Cash', 'UNKNOWN', 'Digital Wallet', 'ERROR'],
      dtype=object)

In [284]:
df.isna().sum()

Transaction ID             0
Item                       0
Quantity                  12
Price Per Unit            38
Total Spent               10
Payment Method             0
Location                3224
Transaction Date         153
missing values count       0
dtype: int64

In [291]:
df['Location'].mode()

0    In-store
1    Takeaway
Name: Location, dtype: object

In [294]:
loc_modes = ['In-store','Takeaway']

In [297]:
import random
df['Location'].fillna(random.choice(loc_modes),inplace=True)

C:\Users\kkuri\AppData\Local\Temp\ipykernel_17488\2200305376.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Location'].fillna(random.choice(loc_modes),inplace=True)

In [300]:
df.drop(columns='missing values count',inplace=True)

C:\Users\kkuri\AppData\Local\Temp\ipykernel_17488\2350404862.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.drop(columns='missing values count',inplace=True)

In [301]:
df.isna().sum()

Transaction ID        0
Item                  0
Quantity             12
Price Per Unit       38
Total Spent          10
Payment Method        0
Location              0
Transaction Date    153
dtype: int64